pages/favorites.org
#+setupfile:./hugo_setup.org
#+hugo_slug: items
#+TITLE: Items

Items I bring with me.
Always subject to change.

Eventually, once my life is better defined, I'd like to organize my possessions based on the following.
I want to be able to move to other places for long periods of time but still have a 'home base'.
Each level implicitly includes everything from the prior levels.
* Temp
Items I bring with me everywhere.
- Keys
- Wallet
- Camera
- Phone
- Earbuds(?)
* Daily
Items I take with my every day -- to work or out on a Saturday.
- Bag
- Laptop
- Headphones (?)
- Notebook
- Pen/Pencil
- Charger
* Weekly
Items I'd like to bring with me on trips that last from a few days
to a week for weekend or weeklong trips.
This could feasibly last longer than a week but may not be the most
comfortable for long term.
Essentially this is anything that will require packing clothing.
- Jacket
- Tee(s)
- Pants
* Indefinitely
Items I'd like to have with me for a long period of time.
These items will help me live in a place longer term.
- Extra monitors
- Variety of clothes
- Laptop dock
* Permanent
Items I would like to keep but am not actively concerned with.
They belong at my home base -- I'm good as long as I have them stored
somewhere and can access them at all.

These items include investments, memorabilia and personal documents.

* Temp
For now, I'll organize based on category.
I find this method easier to inventory in the meantime.

* EDC/Accessories
- Wallet :: Big Skinny
  It's not pretty but it's the lightest wallet on the market
  with multiple spots for cards and different IDs.
  I dislike the fabric of choice and exposed stitching.
  Ironically, their rubber logo patch is thicker than the wallet
  itself (and not very attractive) so I've ripped it off.
 
  Open to other non-folding wallet options that fit 5+ cards
  (transit pass, gov't ID, school ID, credit, debit, insurance)
  and with a pocket for a decent amount of cash.
 
- Keys :: DSPTCH Key Fob Thing
  Actively considering other solutions, especially those with the
  wind up string thing.
** TODO Other Accessories
I've been somewhat considering items like a watch,
bracelets, etc. but I have a hard time justifying their utility.

* Writing
- Pencil :: Pentel Orenz Nero
  Compact, feels great, auto-dispenses lead.
  (Close second: Uni Kuru Toga. Designs are worse and it's harder to use
  the pencil to sketch, but the rotating tip is a killer idea.)
- Pen :: Fisher Space Pen (with clip!)
  Writes everywhere, feels good, looks great.
- Eraser :: Uno Knockback
  I like having an eraser separate from the pen.
  Much better quality and makes the experience much easier.
- Notebook :: Moleskine Classic Notebook - Black. 5x8.25 in. Squared layout.
  I haven't done much research into this either,
  but it's the perfect size for a notebook and I require something
  that's well-bound and has a hard cover for writing without a proper surface.
** TODO Digitizing Notes
I am considering using an e-ink tablet (and corresponding stylus)
for writing instead of these items.
However, the current technology is not mature or open enough to be practical.

* Clothing
** Socks
- Everyday :: Balega (mix of low rise and mid rise).
  Best socks I've ever worn. Incredibly soft and comfortable, breathable,
  sweat wicking and the low rise socks have protection for the back of the ankle
  that with some shoes is prone to abrasion.
- Workout :: Low-rise Smartwool socks. Super thin and merino wool is
  super durable and breathable, if a bit uncomfortable.
- Formal :: Currently I wear some cheap socks from TK-MAX or something.
  Would appreciate more formal socks from a company like Balega
  but haven't done enough research.
** Underwear
- Daily :: Uniqlo Airism boxer briefs.
  Incredibly comfortable, portable and compact.
** Shoes
Most shoes are left over from an obsessive interest in fashion.
Now that I am more interested in utility, as these shoes wear out
I will look for more durable sneakers to wear for the longer term.

- Casual :: Nike x A Cold Wall Vomero 5 - Black
  Incredible looking bulky shoes.
  As comfortable as dad shoes but still accrue a ton of compliments.
- Daily :: Nike x Stone Island Sock Dart - Black
  The sillhouette of these shoes is enough to appear professional -
  I've gotten and attended interviews in these sneakers! - but they're
  still casual and comfortable enough to wear daily and outside of the office.
- Workout :: Adidas Boost Something
  I honestly need new running shoes.

  Perhaps:[[ https://www.salomon.com/en-us/shop/product/snowcross-adv-ltd.html][Salomon Snowcross Advanced]], [[https://www.salomon.com/en-us/shop/product/xt-4-advanced.html#color=20698][Salomon XT-4 Advanced]], or 
** Pants
- Everyday :: Enfin Leve Ametzu
  Great all-around pant. They look formal dressed up
  and dressed down they're similar to a standard jean.
  The Schoeller Dryskin fabric is killer.
- Travel / Comfort :: Enfin Leve Aldatze
  Baggy, futuristic pants that are super comfortable.
  I feel great wearing these everywhere and they look incredible.
  Again, the Schoeller Dryskin fabric is killer.
- Lounge :: Issey Miyake Homme Plisse Lounge Pants
  These pants are weightless and look luxurious.
  The appearance of the pleats is unmatched.

I wear other pants as well but they pale in comparison to these.
I'm looking into pants from Outlier and Veilance as well,
but I haven't had the opportunity to try them and they do not seem
to be as interesting (Outlier) or as durable (Veilance) than my current pairs.
*** TODO Workout pants
** TODO Shorts
I haven't found the perfect pair of shorts yet.
I don't wear shorts often but it would be neat to have an interesting pair.
I'm interested in good looking, breathable cargo shorts primarily.
I also don't have an ideal workout short yet.
** Shirts
- Daily :: Costco multi-pack tees / H&M black tees.
  These tees are left over from previous purchasing mistakes, honestly.
  I'd like to replace these with more flexible and wearable merino wool clothing.
  Primarily considering Outlier tee shirts here.
- Formal :: A basic white oxford.
  Considering swapping this for something more versatile and breathable
  from Outlier or Wool and Prince.
- Fun :: Shirts can and should be used for self-expression too.
  - Y-3 Yohji Tee. Incredibly baggy shirt, folds super well on the body.
    Very cool graphic with a Yohji Yamamoto self-portrait. Avant garde.
  - Yung Lean Warlord Tour Tee. One of my favorite artists and an incredible
    black and white graphic.
  Fun shirts are shirts I may rotate out for others in the future when at home.
*** TODO workout, better basics
** Outerwear
- All-weather :: Nikelab ACG 2 in 1.
  Perfect jacket. Super flexible and waterproof. Comes with the hood.
- Hoodie :: Cav Empt Heavy Hoodie - white stripe.
  This hoodie fits my body type perfectly like no other hoodie I've tried has.
  I wish the hoodie were a bit lighter so I could wear it in sunnier weather
  and so it was more portable but the cut of the garment is unparalleled.
 
The other jackets I typically bring with me are a Y-3 SS14 'Light Jacket' for
lighter weather and an Adidas x Reigning Champ sample oversized Coach Jacket.
I love the look of both but in terms of utility they are super interchangeable --
they add some variety to the closet, but I could live without them if need be.
I also have a cropped sweater from Urban Outfitters but that should be swapped out
for something higher quality as well for more formal settings.

** TODO Portable Formalwear
I'd like something weatherproof that won't stand out in a more formal setting.
This is something I'd also use as a layering piece over the hoodie when the
weather is rough but I don't need or want something heavy duty.
Veilance has made a variety of different overcoats and formal jackets
that fit this description, but I'd like to try different options in store
before committing to one.

* Tech
- Laptop :: Dell XPS 13
  This laptop is okay.
  I like the size and it's gotten me through school, but I
  wish it had better Linux compatibility and better battery
  life in the long term. The build quality could be better too.
  Upgrade: likely Thinkpad X1 Carbon.

  Another consideration I have is bringing around a smaller computer
  like a smartphone or Pi that I use for all of my computing,
  plugging this computer into monitors docked at my workspaces as needed.
  This is only really feasible when I have a stable long term working tactic.
- Camera :: Fujifilm X-T3
  I love this camera.
  It gives me the same control I enjoy from film cameras but in a
  light, portable, digital body. Lens selection is plentiful and lenses
  are small enough to be portable.
  Lenses:
  - 23mm F2 WR
  Strap: DSPTCH Camera Wrist Strap
- Smartphone :: Samsung Galaxy S9
  Note: I haven't put much thought into my smartphone.
  As technology progresses I would like to use a Linux phone with NixOS
  or a technology with a similarly configurable build system but for now Android seems best.
- Headphones :: Bose QC35 II
  The quintessential noise-cancelling headphones. They're recommended everywhere for a reason.
  I do wish that they had USB-C support like all of my other devices for ease of charging.
** TODO Earbuds
Once true wireless earbud technology seems to have matured (esp. with noise cancelling)
I will be making use of earbuds instead of headphones for greater portability.
** TODO Lenses
It's fun to have just one camera lens to work with but the focal length doesn't
cut it for a lot of street work. I'm considering adding the 35mm F2 WR and/or 50mm F2 WR to my kit.
** TODO Audio
If I want to record high quality audio or take video in the future,
I should have a system for that. Sampling the audio of my environment seems just as cool
as taking photos of the environment; I'd want a portable recorder I could easily mount to
my camera to take videos if need be.
** TODO Cables
Obviously I have cables, but I'd like to put more thought into the cables I have.
I don't really even know what cables I use as of now.

* Bags
- Day Bag :: DSPTCH Slingpack - Ballistic Nylon
  Though I use this bag daily, I'm not super happy with it.
  I wish the bag were lighter and offered more organization,
  but it's the best option I was able to find on the market for my use case
  (Laptop case, ~15L of space, dedicated space for pencil storage, quick sling)
  that looks good.
 
  Bagjack and older Veilance may have good options as well.
  I will say that the module system and quick sling are killer --
  I likely will not never purchasing a pack without a similar system.
- Backpack :: Cote et Ciel Nile - Obsidian Black
  I have mixed feeling about this bag as well.
  I love the capacity and flexibility of the bag -- it's great for grocery shopping and carrying large, unstructured items such as clothing -- but the lack of organization is painful when traveling.
** TODO other bags
- A large, packable bag for carrying laundry, extra groceries
- Bags for holding shoes during luggage. this could serve as laundry bag as well
- A small transit bag (smaller than the day bag) for a camera and a couple of essentials
  When traveling this would serve as the case for my camera.
- A nice looking suitcase (mine is fine but I want something that looks better)
* CANCELLED Transportation
CLOSED: [2020-11-16 Mon 20:28]
:LOGBOOK:
- State "CANCELLED"  from "TODO"       [2020-11-16 Mon 20:28] \\
  This is stupid. I can use my feet most places I'll be; I have the patience and it takes up very little space. As needed, I'll get a small bike or skateboard that'll pack well. There's no need for me to worry about one more thing for me to charge, so tech like boosted boards should be avoided.
:END:
I'd like an item I can pack and bring with me to use as transport wherever I end up.
This would be something like a small electric skateboard;
it has to be flexible enough to pack in a medium-sized suitcase,
but versatile enough to take me across much of a city and back.

Ideas:
- Boosted board mini x
- Segway One S1

** etc
- better toothbrush
- travel razor
- some way to convert 2xAAA or 2xAA to usb-c charging (may need to just buy the battery charger...)
- usbc to micro usb for charging (for now)
- charging brick that allows you to plug in thunderbolt cable (more flexible than having usbc cable tightly coupled to power brick; the mac one may be the best here)
  
* Try
darn tough socks

[[https://www.reddit.com/r/onebag/comments/idbo3l/a_collaborative_website_with_this_subs_favorite/][A collaborative website with this sub&#39;s favorite brands - onebag]]


https://floydhome.com/products/the-floyd-platform-bed?color=Walnut+%2F+Black&amp%3BbedSize=twin&headboard=none&bedSize=full-queen the floyd platform bed, looks very cool - it floats!
https://crlf.site/log/notes/200530-links/
https://tilde.town/~dustin/ cool site to take inspiration from


https://opguides.info/ opinionated guides? [[file:music.org][Music]]  work is very represented here

http://www.miha-co.ca/projects/masslessclouds beautiful exhibition, incredible website
https://irimi.one/uses/ this guy has some cool items to check out
